Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་འཇིག་རྟེན་གྱི་ཁམས་དེར་འཕང་བར་མི་འགྱུར་བར་བཅོམ་ལྡན་འདས་བདག་ལ་བསྐྱབ་ཏུ་གསོལ།
en: “Blessed One, please protect us so that the bodhisattva Sāgaramati does not send us to that world.

source: བདེ་བར་གཤེགས་པ་བདག་ལ་བསྐྱབ་ཏུ་གསོལ།
en: Blissful One, please protect us!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྡིག་ཅན་མ་འཇིགས་ཤིག།
en: “Evil ones,” said the Blessed One, “do not be afraid.

source: སྐྱེས་བུ་དམ་པ་འདི་ལྟ་བུ་འདི་དག་ནི་སེམས་ཅན་ལ་རྣམ་པར་འཚེ་བའི་ཕྱིར་གནས་པ་མ་ཡིན་ནོ། །
en: These sublime beings are not out to harm others.

source: སྡིག་ཅན་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་འདི་ལ་བཟོད་པ་གསོལ་ཅིག་དང་། འདི་ཉིད་ཁྱོད་ལ་སྐྱོབ་པར་འགྱུར་རོ། །
en: Evil ones, beg the bodhisattva Sāgaramati to be patient with you and he will offer you protection.”

source: དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་ཐལ་མོ་སྦྱར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་ལ་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The evil māras then joined their palms together and, prostrating to the bodhisattva Sāgaramati, pleaded,

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་བདག་ལ་བཟོད་པ་མཛད་དུ་གསོལ།
en: “Sublime being, please be patient with us.

source: བདག་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེར་མི་འཕང་བར་གསོལ།
en: Please do not send us to the world Adorned with Every Pleasure.

source: ཇི་ལྟར་གང་ན་སྐྱེས་བུ་དམ་པ་ཁྱོད་ལྟ་བུ་ཆོས་སྟོན་པར་གྱུར་པའི་འཁོར་དེར་བར་ཆད་བགྱི་བའི་སླད་དུ་ལན་འགའ་ཡང་མཆི་བར་མི་འགྱུར་བ་དེ་ལྟར་བགྱིའོ། །
en: We will not even occasionally make obstacles for the assembly when a sublime being like yourself is teaching Dharma.”

source: བློ་གྲོས་རྒྱ་མཚོས་སྨྲས་པ། སྡིག་ཅན་ཁོ་བོ་ལྟ་བུ་དག་ལ་བཟོད་པ་གསོལ་མི་དགོས་སོ། །
en: “Evil ones,” responded Sāgaramati, “you do not need to ask me to be patient with the likes of you.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཤིན་ཏུ་བཟོད་པ་ཉིད་དོ། །
en: Bodhisattvas are extremely patient with all beings.

source: སྡིག་ཅན་ཁྱོད་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེར་སོང་ལ།
en: Evil ones, go to the world Adorned with Every Pleasure.

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བཀོད་པ་དེ་དག་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་རབ་ཏུ་འཇོམས་པ་དེ་ལ་ལྟོས་ཤིག་དང་ཁྱོད་ལ་འཚེ་བར་མི་འགྱུར་རོ། །
en: See the appearances of that world and the blessed thus-gone Mārapramardaka for yourselves. No harm will come to you.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་ལག་པ་གཡས་པ་གསེར་གྱི་ཁ་དོག་ཅན་བརྐྱང་ནས། བདུད་སྡིག་ཅན་གྱི་སྤྱི་བོར་བཞག་ནས།
en: The bodhisattva Sāgaramati then extended his golden-colored right hand, placing it upon the heads of the evil ones.

source: བདེན་པ་དང་བདེན་པའི་ཚིག་གང་གིས་
en: He blessed them with such words of truth:

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཆོས་ཀྱི་སེར་སྣ་དང་། སློབ་དཔོན་ཆོས་ཀྱི་དཔེ་མཁྱུད་མེད་པའི་བདེན་པ་དང་བདེན་པའི་ཚིག་དེས་བདག་གིས་རྫུ་འཕྲུལ་གྱི་རྐང་པ་ཅི་འདྲ་བར་བདུད་སྡིག་ཅན་གྱི་ཡང་དེ་དང་འདྲ་བར་གྱུར་ཅིག་ཅེས་དེ་ལྟ་བུའི་བདེན་པའི་བྱིན་གྱི་རླབས་བྱས་སོ། །
en: “Through the truths and words of truth that enable the bodhisattvas to not be stingy with the Dharma and teachers to not withhold the Dharma, may these evil māras come to possess the bases of miracles in the same way that I do.”

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་ཚིག་དེ་སྐད་ཅེས་སྨྲས་མ་ཐག་ཏུ། དེ་ནས་བདུད་སྡིག་ཅན་རྫུ་འཕྲུལ་གྱི་སྟོབས་མཆོག་དང་ལྡན་པར་གྱུར་ཏེ།
en: As soon as the bodhisattva Sāgaramati pronounced this, the evil māras were endowed with the supreme strength of miracles.

source: དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་བྱས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་མི་སྣང་བར་གྱུར་ཏེ།
en: The worlds of this great trichiliocosm shook six times, and the evil māras disappeared from this buddha realm.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོའི་བྱིན་གྱི་རླབས་ཀྱིས་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེར་གནས་པར་གྱུར་ཏོ། །
en: It was through the blessing of the bodhisattva Sāgaramati that they arrived at the world Adorned with Every Pleasure in that very same moment.

source: དེ་ནས་བདུད་སྡིག་ཅན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བདུད་རབ་ཏུ་འཇོམས་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: The evil māras went before the blessed, thus-gone, worthy, perfect buddha Mārapramardaka.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་བདུན་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: They bowed their heads to the Blessed One, circumambulated him seven times, and sat to one side.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་རབ་ཏུ་འཇོམས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བདུད་ལས་བཏུལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་འཁོད་པ་དེ་དག་གིས་བདུད་སྡིག་ཅན་དེ་མཐོང་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་རབ་ཏུ་འཇོམས་པ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When all the bodhisattvas who had been converted from among the māras in the buddha realm of the blessed thus-gone Mārapramardaka saw these evil ones, they asked the blessed thus-gone Mārapramardaka,

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་དབང་ཆུང་ཞིང་མདོག་ངན་ལ་མི་སྡུག་པ་འདི་ལྟ་བུ་འདི་གང་ནས་མཆིས།
en: “Blessed One, where have these pitiful, pallid, and ugly beings come from?”

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ནུབ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་གང་གཱའི་ཀླུང་བཅུ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དོ། །
en: “Noble children,” answered the Blessed One, “beyond buddha realms numbering twelve times the grains of sand in the Ganges to the west of this buddha realm is the Sahā world.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་བཞུགས་སོ། །
en: There is the blessed, thus-gone, worthy, perfect buddha Śākyamuni.

source: འཚོའོ་གཞེས་སོ། །
en: There he lives and remains.

source: དེ་འདུས་པ་ཆེན་པོའི་ལེའུ་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་རྒྱ་ཆེར་སྟོན་ཏོ། །
en: He gives Dharma teachings on the sections of The Great Compilation .

source: ཡང་དག་པར་རབ་ཏུ་འཆད་དོ། །
en: He explains truly.

source: དེར་ཕྱོགས་བཅུ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཚད་མེད་གྲངས་མེད་ཅིང་བགྲང་བ་ལས་ཤིན་ཏུ་འདས་པ་དག །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མཉན་པའི་ཕྱིར་འདུས་སོ། །
en: Immeasurable, countless, and incalculable bodhisattvas from throughout the ten directions have gathered there to study this Dharma teaching.

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བྱ་བ་གོ་ཆ་བསམ་གྱིས་མི་ཁྱབ་པ་བགོས་པ།
en: In that bodhisattva assembly is the bodhisattva great being Sāgaramati, who wears the unfathomable armor.

source: བཅོམ་ལྡན་འདས་དེ་ལ་ཡོངས་སུ་འདྲི་ཞིང་ཡོངས་སུ་འདྲིར་འཇུག་པ་ཡང་འདུས་པར་གྱུར་ཏོ། །
en: They are there to question that blessed one and to initiate questions.

source: ཆོས་ཀྱི་རྣམ་གྲངས་དེའི་ཐ་མ་བཤད་པའི་ཚེ་བདུད་སྡིག་ཅན་མིག་གིས་མི་རྩོལ་བར་བྱ་བའི་ལས་ཀྱི་ཕྱིར་འོངས་པ་དང་།
en: At the end of that Dharma teaching, these evil māras showed up to create confusion.

source: སྐྱེས་བུ་དམ་པ་དེས་འདུལ་བའི་དབང་ཉེ་བར་བཟུང་སྟེ། བདུད་སྡིག་ཅན་དེ་འཇིག་རྟེན་གྱི་ཁམས་འདིར་འཕངས་སོ། །
en: These evil māras were tamed and overpowered by that sublime being and sent to this world.”

source: དེ་ནས་བདུད་ལས་བཏུལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The bodhisattvas who had been converted from among the māras then said to the evil māras,

source: ཁོ་བོ་ཅག་ཀྱང་ཁྱོད་ཀྱི་གྲོགས་ཡིན་གྱིས། སྡིག་ཅན་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིག །
en: “We are also your friends. Evil ones, develop the mind directed toward unsurpassed and perfect awakening!

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཁོ་བོ་ཅག་ཀྱང་བདུད་དུ་གྱུར་ཏེ།
en: Why must you do this? We were also māras.

source: སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བའི་བར་ཆད་བྱ་བའི་ཕྱིར་ཞུགས་པ་ལས། ཁོ་བོ་ཅག་དེ་བཞིན་གཤེགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Though we had set out to obstruct beings’ roots of virtue, because of the Thus-Gone One, we developed the mind directed toward unsurpassed and perfect awakening.

source: དེ་ལྟ་བས་ན་སྡིག་ཅན་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིག །
en: Therefore, you evil ones too: develop the mind directed toward unsurpassed and perfect awakening!”

source: དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་ཚིག་འདི་སྐད་ཅེས་
en: Then the evil māras developed the mind directed toward unsurpassed and perfect awakening with an altruistic intention, proclaiming,

source: བདག་གིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ་ཕྱིན་ཆད་བདུད་ཀྱི་ལས་མི་བྱའོ་ཞེས་སྨྲས་སོ། །
en: “We give rise to the mind directed toward unsurpassed and perfect awakening, and henceforth shall not engage in any actions of māras!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བདུད་སྡིག་ཅན་རིན་པོ་ཆེ་བཀོད་པའི་སེང་གེའི་ཁྲི་ལ་བཞག་སྟེ།
en: The bodhisattvas then placed the evil māras on a jeweled lion throne and implored them,

source: དེ་ན་འདུས་པ་ཆེན་པོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་གཏམ་རྒྱུད་ཅི་འདྲ་བ་ལ་རིགས་ཀྱི་བུ་ཁྱོད་སྤོབས་པར་གྱིས་ཤིག་ཅེས་གསོལ་བ་བཏབ་བོ། །
en: “Noble sons, please elucidate a faithful recounting of the Dharma teachings on the sections of The Great Compilation .”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་གང་བདུད་སྡིག་ཅན་སེང་གེའི་ཁྲི་ལ་འདུག་པའི་ཁའི་སྒོ་དང་། བ་སྤུའི་ཁུང་ཐམས་ཅད་ནས་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་འདུས་པ་ཆེན་པོའི་ལེའུ་རབ་ཏུ་བཤད་པ་ལྟ་བུའི་གཏམ་བྱུང་སྟེ
en: Then bodhisattva Sāgaramati offered his blessings such that the exact utterance of The Great Compilation spoken by the Blessed One Śākyamuni came from the mouths and pores of the māras on the jeweled lion throne.

source: ཡི་གེ་དེ་དག་དང་། ཚིག་དང་། ཡི་གེའི་འབྲུ་དེ་དག་དང་མཉམ་ཞིང་མི་ཉུང་མི་མང་མ་ལྷག་པར་འགྱུར་བ་དེ་ལྟ་བུའི་བྱིན་གྱི་རླབས་བྱས་སོ། །
en: It was equal in letter, word, and syllable, without anything missing, anything extra, or anything left over.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བདུད་སྡིག་ཅན་དེ་ལས་འདུས་པ་ཆེན་པོའི་ལེའུའི་གཏམ་ཐོས་ནས། ངོ་མཚར་དུ་གྱུར་ཏེ་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, when the bodhisattvas heard the teachings on the sections of The Great Compilation from the evil māras, they were amazed, and declared to the Blessed One,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་དེ་དང་། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་བལྟ་བར་བགྱིའོ། །
en: “Blessed One, we will visit the Sahā world, the blessed thus-gone Śākyamuni, the bodhisattva Sāgaramati, and the bodhisattvas gathered from throughout the ten directions!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་རབ་ཏུ་འཇོམས་པས་མཛོད་སྤུ་ནས། གཟུགས་ཐམས་ཅད་སྟོན་པ་ཞེས་བྱ་བའི་འོད་ཟེར་ཕྱུང་སྟེ།
en: The blessed thus-gone Mārapramardaka then emitted light rays called “displaying all form” from his ūrṇa hair.

source: འོད་ཟེར་ཕྱུང་བ་དེས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཅུ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་དེ་དག་ལས་འདས་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །
en: The light rays passed through buddha realms numbering twelve times the grains of sand in the Ganges to bathe the Sahā world with a brilliant glow.

source: དེར་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་རིན་པོ་ཆེ་བཀོད་པའི་འཁོར་གྱི་ཁྱམས་ན་བསྐལ་པ་བརྒྱར་ཡང་བསྔགས་པའི་མཐར་མི་ཕྱིན་པའི་སེང་གེའི་ཁྲི་ཆེན་པོ་ལ་བཞུགས་ཏེཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་འདུས་པ་ཆེན་པོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་ཡང་མཐོང་ངོ་། །
en: The bodhisattvas now saw the blessed thus-gone Śākyamuni seated on a lion throne, the praises of which could not be fully sung in a hundred eons, giving detailed Dharma teachings on the sections of The Great Compilation to the bodhisattvas who had gathered from throughout the ten directions in the jeweled courtyard. They also saw the bodhisattva Sāgaramati there.

source: འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཆུས་ཡོངས་སུ་གང་བའི་རྒྱ་མཚོ་གཅིག་ལྟ་བུར་གནས་པ་འདི་ཡང་མཐོང་ངོ་། །
en: They also saw the Sahā world filled with water as if it were a single ocean.

source: དེ་ནས་སྒྲིབ་པ་ཅི་ཡང་མེད་པར་མཐོང་ངོ་། །
en: They saw all of this completely clearly.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྒྱང་གྲགས་ཀྱི་ཚད་ཙམ་གྱི་རིན་པོ་ཆེའི་པད་མ་དག་ལ་འཁོད་ཅིང་ཆོས་ཉན་པ་དེ་དག་ཀྱང་མཐོང་ངོ་།
en: Further, they saw the bodhisattvas gathered from throughout the worlds of the directions arranged on jeweled lotuses, each a league in length, listening to the Dharma.

source: མཐོང་ནས་ཀྱང་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ།
en: Seeing this, they were satisfied, happy, joyful, and delighted.

source: དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེ་ལོགས་སུ་མེ་ཏོག་གཏོར་ཏོ། །
en: Being happy and pleased, they cast flowers toward the blessed thus-gone Śākyamuni.

source: གཏོར་མ་ཐག་ཏུ་སངས་རྒྱས་ཀྱི་མཐུས་འོངས་ནས། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྤྱི་གཙུག་གི་མཚམས་སུ་མེ་ཏོག་གི་གདུགས་ཆེན་པོར་གྱུར་ཏོ། །
en: Through the power of the Buddha, the flowers instantly formed into a great parasol over the crown of the Blessed One Śākyamuni’s head.

source: དེར་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་མེ་ཏོག་གི་གདུགས་དེ་མཐོང་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: The entire assembly was amazed when they saw this flower parasol.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་མེ་ཏོག་གི་གདུགས་འདི་ལྟ་བུར་གྱུར་པའི་མེ་ཏོག་འདི་དག་གང་ནས་མཆིས།
en: “Blessed One,” they asked, “where has the flower parasol made of these kinds of flowers come from?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གྲོགས་པོ་དག་མེ་ཏོག་འདི་དག་ནི་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ནས་འོངས་ཏེ།
en: “Friends,” the Blessed One answered, “these flowers have come from the world Adorned with Every Pleasure.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ང་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་གཏོར་ཏོ། །
en: The bodhisattvas there threw them as an act of venerating me.”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་རབ་ཏུ་འཇོམས་པ་དེ་དང་། བདུད་སྡིག་ཅན་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ཅི་བགྱིད་པ་བལྟ་བར་བགྱིའོ། །
en: “Blessed One, we want to see the world Adorned with Every Pleasure and what the blessed thus-gone Mārapramardaka and the evil māras are doing there.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་དེས་གསོལ་བ་བཏབ་པ་མཁྱེན་ནས། བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་ལ་བཀའ་སྩལ་པ།
en: Then, understanding the request made by the assembly, the Blessed One said to the bodhisattva Sāgaramati,

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་རབ་ཏུ་འཇོམས་པ་དེ་དང་། བདུད་སྡིག་ཅན་དེ་འཁོར་འདི་ལ་སྟོན་ཅིག །
en: “Noble son, show the world Adorned with Every Pleasure, the blessed thus-gone Mārapramardaka, and the evil māras to the assembly!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྐབས་ཕྱེ་བས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་སོར་མོ་བཅུ་ལས་འོད་ཟེར་སྟོང་ཕྲག་བཅུ་ཕྱུང་ནས། འོད་ཟེར་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཅུ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་པོ་དེ་དག་ལས་འདས་ནས་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །
en: Then, given the opportunity by the Blessed One, ten thousand light rays sprang from the bodhisattva Sāgaramati’s ten fingers, passing through buddha realms numbering twelve times the grains of sand in the Ganges to bathe the world Adorned with Every Pleasure with a brilliant glow.

source: དེར་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་རབ་ཏུ་འཇོམས་པ་དེ་དང་། བདུད་སྡིག་ཅན་ཆོས་ཀྱི་ཁྲི་ཆེན་པོ་ལ་འདུག་སྟེ་འདུས་པ་ཆེན་པོའི་ལེའུའི་གཏམ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་ཡང་མཐོང་ངོ་། །
en: They beheld the entire assembly, the world Adorned with Every Pleasure, the blessed thus-gone Mārapramardaka, and the evil māras seated on the great Dharma throne, extensively giving Dharma teachings on the sections of The Great Compilation .

source: མཐོང་ནས་ཀྱང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་དུ་གྱུར་ནས་རང་རང་གི་པད་མའི་སྟན་ལས་ལངས་ཏེ།
en: Seeing this, they were astonished, and arose from their lotus seats to prostrate to the blessed thus-gone Mārapramardaka.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་རབ་ཏུ་འཇོམས་པ་དེ་ལ་ཕྱག་འཚལ་ནས། དེ་དག་གིས་མུ་ཏིག་དང་། མེ་ཏོག་གིས་གཏོར་ཏོ། །གཏོར་མ་ཐག་ཏུ་སངས་རྒྱས་ཀྱི་མཐུས་འོངས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱི་གཙུག་གི་མཚམས་སུ་མེ་ཏོག་གི་ཁང་པ་བརྩེགས་པ་ཆེན་པོར་གནས་པར་ཀུན་ཏུ་སྣང་ངོ་། །
en: They threw pearls and flowers toward the Blessed One and, immediately, through the power of the Buddha, the pearls and flowers appeared as a mansion of flowers at the crown of the Blessed One’s head.

source: དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་རབ་ཏུ་འཇོམས་པ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The evil māras then declared to the blessed thus-gone Mārapramardaka,

source: བཅོམ་ལྡན་འདས་བདག་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་གན་དུ་མཆིའོ། །
en: “Blessed One, we will go before the Blessed One Śākyamuni in the Sahā world.”

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེའི་དུས་ལ་དབབ་པར་ཤེས་ན་ཁྱོད་སོང་ཤིག །
en: “Noble children,” answered the Blessed One, “if you know that the time has come, then go.”

source: དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་བདུན་བསྐོར་བ་བྱས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་མི་སྣང་བར་གྱུར་ཏེ
en: At that point the evil māras prostrated to the feet of the Blessed One and circumambulated him seven times, disappearing from that buddha realm.

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོའི་བྱིན་གྱི་རླབས་དང་། རྫུ་འཕྲུལ་གྱིས་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་གནས་པར་གྱུར་ཏོ། །
en: Through the blessings and miraculous power of the bodhisattva Sāgaramati, in that very same moment, they arrived in this Sahā world.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ །
en: They went before the Blessed One and bowed their heads to his feet. Then they circumambulated him seven times, prostrated to him, and took their seat off to one side.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Venerable Śāradvatīputra then asked the evil māras,

source: གྲོགས་པོ་ཁྱོད་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་དེ་མཐོང་ངམ།
en: “Friends, did you see the world Adorned with Every Pleasure?”

source: སྨྲས་པ། བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་གིས་འཇིག་རྟེན་གྱི་ཁམས་ཇི་ཙམ་དུ་ཡོངས་སུ་དག་པ་དེ་མཐོང་སྟེ
en: “Venerable Śāradvatīputra, we saw that world in all its purity.

source: ཇི་ལྟར་དག་ཅིང་དྲི་མ་མེད་པའི་སེམས་ཅན་མཆོག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གནས་དེ་ངོ་མཚར་ཏོ། །
en: That realm of bodhisattvas—the most supreme of pure and immaculate beings—is astounding.

source: བདག་གིས་དེ་མཐོང་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Seeing it, we also developed the mind directed toward unsurpassed and perfect awakening.”

source: སྨྲས་པ། གྲོགས་པོ་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། ཁྱོད་ཀྱང་བདུད་ཀྱི་ལས་ལྟ་བྱེད་དམ།
en: “Friends, having developed the mind directed toward unsurpassed and perfect awakening, do you plan any māra activity?”

source: སྨྲས་པ། བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལྷག་པའི་བསམ་པ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གང་གིས་ཀྱང་བདུད་ཀྱི་ལས་བྱེད་མི་ནུས་སོ། །
en: “Venerable Śāradvatīputra, we cannot perform any māra activity against bodhisattvas who have developed pure motivation.

source: ལྷག་པའི་བསམ་པ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཇི་ལྟ་ཇི་ལྟར་བདུད་ཀྱི་ལས་བྱེད་པ་དེ་ལྟ་དེ་ལྟར།
en: To the degree that we perform māra activity, the bodhisattvas get stronger and more diligent.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆེས་སྟོབས་དང་ལྡན་ཞིང་བརྩོན་འགྲུས་རྩོམ་མོ། །བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་གང་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བདུད་ཀྱི་ལས་བྱེད་པ་དེ་ཉིད། སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་སུ་བརྗོད་ཀྱི་བདུད་ཀྱི་ལས་ནི་མ་ཡིན་པ་དེ་ལྟར་རིག་པར་བྱའོ། །
en: Venerable Śāradvatīputra, from this point, you should understand that when māra activity is aimed at bodhisattvas, that very activity is said to be buddha activity. It is not māra activity.”

source: སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་ཏུ་བསྟན་པ་དང་། བདུད་ཀྱི་ཆོ་འཕྲུལ་བསྟན་པ་འདི་བཤད་པ་ན་འཁོར་དེ་ལས་སྲོག་ཆགས་ཉི་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Once the revelations of the buddha realm and the miracle that happened to the māras were recounted, twenty thousand beings in the assembly developed the mind directed toward unsurpassed and perfect awakening.

source: བདུད་ཀྱི་འཁོར་དེ་ལས་ཀྱང་བདུད་ཀྱི་བུ་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་མགྲིན་གཅིག་ཏུ་
en: Ten thousand māras in the māra assembly also developed the mind directed toward unsurpassed and perfect awakening, and proclaimed with one voice,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་དེར་སྐྱེ་བར་གྱུར་ཅིག་ཅེས་ཚིག་དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: “Blessed One, may we be born in the world Adorned with Every Pleasure!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དེ་དག་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་ལུང་བསྟན་ཏོ། །
en: The Blessed One then prophesied their birth in that buddha realm.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་དུ་བསྟན་པའི་ལེའུ་སྟེ་བཅུ་གཅིག་པའོ།། །།
en: [Chapter Eleven: The Revelation of Buddha Realms]

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བྱང་ཆུབ་འདི་ནི་བར་ཆད་མང་བ་ཕྱིར་རྒོལ་བ་མང་བ་ལགས་ན། གང་འདི་ལྟ་བུའི་མདོ་སྡེ་འདི་དག་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་ནུབ་པར་མི་འགྱུར་ཞིང་རྒྱས་པར་འགྱུར་བ་དང་། གང་དག་འཛིན་པ་དང་ཀློག་པ་དང་། སྟོན་པ་དེ་དག་ལ་ཡང་བདུད་དམ་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་གླགས་རྙེད་པར་མི་འགྱུར་བ་དང་། དམ་པའི་ཆོས་ཡུན་རིང་དུ་གནས་པ་དང་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་དག་ཀྱང་ཀུན་ཏུ་བསྲུང་བ་དང་སྦ་བ་དང་། ཡོངས་སུ་གཟུང་བའི་སླད་དུ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ལེགས་པར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།
en: “Blessed One, given that the awakening of the thus-gone ones encounters many obstacles and much opposition, please carefully grant your blessings, Blessed One, such that through the blessings of the Thus-Gone One, these sūtras will not fade, but grow; that they will be upheld and read; that their teachers will not have to vie with māras and gods of the class of māras; that this sublime Dharma may long remain; and that these sūtras will be preserved, kept safe, and accepted.”

source: བློ་གྲོས་རྒྱ་མཚོ་སེམས་ཅན་གང་དག་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་དག་འཛིན་པ་དང་། སྟོན་པར་འགྱུར་ཞིང་འདོད་པ་བརྩོན་འགྲུས་བརྩམས་པ། དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དེ་དག་འདུལ་བའི་དབང་ཉེ་བར་གཟུང་སྟེ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱིན་གྱིས་བརླབས་ཟིན་ཏོ། །
en: “Any being who retains such a sūtra as this, Sāgaramati, and teaches it, accepts it, and practices it diligently and develops roots of virtue, will hold the power of discipline and the blessings of this Dharma teaching.

source: བློ་གྲོས་རྒྱ་མཚོ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ཚིག་གང་དག་གིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་དག་བཀུག་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཀུན་ཏུ་བསྲུང་བ་དང་། ཆོས་སྨྲ་བ་དེ་དག་ཀྱང་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ནན་ཏན་བྱེད་པར་འགྱུར་བའི་རྒྱལ་པོ་ཆེན་པོ་བཞི་དགུག་པའི་ཚིག་རྣམས་བརྗོད་པར་བྱའོ། །
en: Therefore, Sāgaramati, listen well and bear what I say in mind: these words will summon the Four Great Kings. So that this Dharma teaching is protected and so those who teach it are accepted, these words that summon the Four Great Kings who work in earnest must be spoken.

source: བློ་གྲོས་རྒྱ་མཚོ་དགུག་པའི་ཚིག་དེ་དག་གང་ཞེ་ན།
en: Sāgaramati, what are the summoning words?

source: འདི་ལྟ་སྟེ། ས་མེ་ས་མ་སན་དྷི། ས་ར་ནེ། ས་ར་པ་ཏི། དྷ་ནེ། དྷ་ན་བ་ཏི། དྷུ་དྷུ་མེ། དྷུ་དྷུ་མ་ཏི། ཨཱ་བརྟེ། ཨ་མ་ལེ། བི་མ་ལེ། བི་ར་ཛེ། ཀ་ཀ་རེ། ཀཱ་རུ་ཎེ། ཧུ་ཧུ། ཧུ་ཧུ་བ་ཏི། ཧུ་ཧུ་སན་དྷི། ནིརྒྷ་ཏ་ནི། ཨ་བཊྚེ། བཱི་བཊྚེ། མ་དྷུ་མ་ཏི་མ་ར་ཛི་ཏེ། བི་ཤུདྡྷེ། བི་ཤུདྷ་བ་ཏི། མི་སི་ལེ། མ་ནོ་ར་ཧ་རེ།
en: They are: samesama­sandhi sarane sarapati dhane dhanavati dhudhume dhudhumati āvarte amale vimale viraje kakare kāruṇe huhu huhuvati huhusandhi nirghatani avatte vīvatte madhu­mati­marajite viśuddhe viśudhavati misile manorahare.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་དག་ནི་དགུག་པའི་ཚིག་རྣམས་ཡིན་ཏེ།
en: Sāgaramati, these are the summoning words.

source: ཚིག་དེ་དག་གིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་བཀུག་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཀུན་ཏུ་བསྲུང་བ་དང་། ཆོས་སྨྲ་བ་དེ་ཡང་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ནན་ཏན་བྱེད་པར་འགྱུར་རོ། །
en: They should be used in earnest, so the Four Great Kings are summoned and this Dharma teaching is protected and its teachers accepted.
